/*

Р Р°Р±РѕС‚Р° СЃ РѕРїРµСЂР°С‚РѕСЂРѕРј IF:

  1. РЎРѕР·РґР°С‚СЊ РїРµСЂРµРјРµРЅРЅСѓСЋ "minAge" Рё РїСЂРёСЃРІРѕРёС‚СЊ РµР№ Р·РЅР°С‡РµРЅРёРµ 18
  2. РЎРѕР·РґР°С‚СЊ РїРµСЂРµРјРµРЅРЅСѓСЋ "maxAge" Рё РїСЂРёСЃРІРѕРёС‚СЊ РµР№ Р·РЅР°С‡РµРЅРёРµ 60
  3. РЎРѕР·РґР°С‚СЊ РїРµСЂРµРјРµРЅРЅСѓСЋ "age", РІ РєРѕС‚РѕСЂСѓСЋ РІС‹ Р±СѓРґРµС‚Рµ РІРІРѕРґРёС‚СЊ РІРѕР·СЂР°СЃС‚ РїСЂРё РІС‹РїРѕР»РЅРµРЅРёРё РїСЂРѕРіСЂР°РјРјС‹
  4. Р”РѕР±Р°РІСЊС‚Рµ РїСЂРѕРІРµСЂРєСѓ: РµСЃР»Рё С‚РёРї РґР°РЅРЅС‹С… РІ РїРµСЂРµРјРµРЅРЅРѕР№ age РЅРµ number - РІС‹РІРµСЃС‚Рё РІ РєРѕРЅСЃРѕР»СЊ Incorrect data type
  4. РЎРѕР·РґР°С‚СЊ if РІ РєРѕС‚РѕСЂРѕРј Р±СѓРґРµС‚Рµ РїСЂРѕРІРµСЂСЏС‚СЊ РІРµСЃСЊ РєРѕРґ РїРµСЂРµРјРµРЅРЅРѕР№ age СЃРѕ СЃР»РµРґСѓСЋС‰РёРјРё СѓСЃР»РѕРІРёСЏРјРё:
    - Р•СЃР»Рё age РјРµРЅСЊС€Рµ С‡РµРј minAge, РІС‹РІРµСЃС‚Рё РІ РєРѕРЅСЃРѕР»СЊ "You don't have access cause your age is " + "age" + " It's less then "
    - Р•СЃР»Рё "age" Р±РѕР»СЊС€Рµ Р»РёР±Рѕ СЂР°РІРЅРѕ  minAge Рё РјРµРЅСЊС€Рµ  maxAge, РІС‹РІРµСЃС‚Рё РІ РєРѕРЅСЃРѕР»СЊ "Welcome  !"
    - Р•СЃР»Рё "age" Р±РѕР»СЊС€Рµ maxAge, РІС‹РІРµСЃС‚Рё РІ РєРѕРЅСЃРѕР»СЊ "Keep calm and look Culture channel".
    - Р�РЅР°С‡Рµ РІС‹РІРѕРґРёС‚Рµ "Technical work".
  5. РџСЂРѕРІРµСЂРёС‚СЊ Р·Р°РґР°РЅРёРµ СЃРѕ СЃР»РµРґСѓСЋС‰РёРјРё Р·РЅР°С‡РµРЅРёСЏРјРё РІ РїРµСЂРµРјРµРЅРЅРѕР№ age: 10, 17, 18, 19, 59, 60, 61

  */



  let minAge = 18;
  let maxAge = 60;
  let age = 2;
  if (typeof age !== "number") {
    console.log("Incorrect data type");
  }
  if (age < minAge) {
    console.log(
      `You don't have access cause your age is ${age}. It's less then ${minAge}`
    );
  } else if (age >= minAge && age < maxAge) {
    console.log("Welcome  !");
  } else if (age > maxAge) {
    console.log("Keep calm and look Culture channel");
  } else {
    console.log("Technical work");
  }